
# tap repositories and their packages

tap 'homebrew/core'
brew 'abduco'
brew 'ack'
brew 'adns'
brew 'ant'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'autoconf'
brew 'automake'
brew 'aws-sdk-cpp'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bedtools'
brew 'bindfs'
brew 'bitwarden-cli'
brew 'brightness'
brew 'byobu'
brew 'cairo'
brew 'ccache'
brew 'ccls'
brew 'clang-format'
brew 'cmake'
brew 'coreutils'
brew 'csshx'
brew 'curl'
brew 'dos2unix'
brew 'entr'
brew 'erlang'
brew 'exa'
brew 'expat'
brew 'faad2'
brew 'ffmpeg'
brew 'fftw'
brew 'findutils'
brew 'flac'
brew 'fltk'
brew 'fluid-synth'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'giflib'
brew 'git'
brew 'glances'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'goofys'
brew 'gpgme'
brew 'gpsbabel'
brew 'graphite2'
brew 'grep'
brew 'harfbuzz'
brew 'htop'
brew 'htslib'
brew 'hub'
brew 'icu4c'
brew 'iftop'
brew 'iproute2mac'
brew 'isl'
brew 'jemalloc'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jq'
brew 'json-c'
brew 'lame'
brew 'leptonica'
brew 'libao'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libbluray'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libid3tag'
brew 'libidn2'
brew 'libksba'
brew 'libmpc'
brew 'libmpdclient'
brew 'libnfs'
brew 'libogg'
brew 'libpng'
brew 'libpq'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsoxr'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libupnp'
brew 'libusb'
brew 'libuv'
brew 'libvorbis'
brew 'libvpx'
brew 'libvterm'
brew 'libwebsockets'
brew 'libyaml'
brew 'little-cms2'
brew 'llvm'
brew 'lua'
brew 'lua@5.1'
brew 'luajit'
brew 'lz4'
brew 'make'
brew 'mas'
brew 'maven'
brew 'mosh'
brew 'mpd'
brew 'mpfr'
brew 'mpv'
brew 'msgpack'
brew 'mtr'
brew 'mujs'
brew 'mutt'
brew 'ncurses'
brew 'neovim'
brew 'nethogs'
brew 'nettle'
brew 'newt'
brew 'nmap'
brew 'nnn'
brew 'npth'
brew 'oniguruma'
brew 'openconnect'
brew 'opencore-amr'
brew 'openjpeg'
brew 'openssh'
brew 'openssl'
brew 'opus'
brew 'p11-kit'
brew 'pandoc'
brew 'parallel'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pgcli'
brew 'pidof'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'popt'
brew 'portaudio'
brew 'postgresql'
brew 'postgresql@10'
brew 'protobuf'
brew 'python'
brew 'python@2'
brew 'qt'
brew 'rabbitmq'
brew 'rabbitmq-c'
brew 'readline'
brew 'rename'
brew 'ripgrep'
brew 'rsync'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'rustup-init'
brew 's-lang'
brew 's3cmd'
brew 's3fs'
brew 'samtools'
brew 'sdl2'
brew 'shellcheck'
brew 'shfmt'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'sshfs'
brew 'stoken'
brew 'subversion'
brew 'swift'
brew 'taglib'
brew 'telnet'
brew 'tesseract'
brew 'theora'
brew 'tiger-vnc'
brew 'tmux'
brew 'tokyo-cabinet'
brew 'trash'
brew 'tree'
brew 'ttyd'
brew 'uchardet'
brew 'unbound'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'vapoursynth'
brew 'vim'
brew 'watch'
brew 'watchexec'
brew 'webp'
brew 'wget'
brew 'wine'
brew 'wxmac'
brew 'x264'
brew 'x265'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zimg'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/bundle'

tap 'homebrew/cask-drivers'
cask 'logitech-gaming-software'
cask 'steelseries-exactmouse-tool'

tap 'homebrew/cask-fonts'
cask 'font-fontawesome'
cask 'font-hack-nerd-font-mono'

tap 'homebrew/cask-versions'
cask 'firefox-developer-edition'
cask 'google-chrome-dev'

tap 'homebrew/command-not-found'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'adoptopenjdk'
cask 'apache-directory-studio'
cask 'barrier'
cask 'bitbar'
cask 'dbschema'
cask 'dotnet'
cask 'gimp'
cask 'insomnia'
cask 'java'
cask 'jetbrains-toolbox'
cask 'lumen'
cask 'oni'
cask 'osxfuse'
cask 'pennywise'
cask 'pocket-casts'
cask 'skype'
cask 'spotify'
cask 'tunnelblick'
cask 'virtualbox'
cask 'vlc'

tap 'adoptopenjdk/openjdk'

tap 'brejoc/tap'
brew 'ssht'

tap 'brewsci/bio'

tap 'crisidev/chunkwm'

tap 'koekeishiya/formulae'
brew 'cev'
brew 'chunkwm'
brew 'skhd'
brew 'yabai'

tap 'koekeishiya/formulae'

tap 'koekeishiya/formulae'

tap 'microsoft/mssql-release'
brew 'msodbcsql17'
brew 'mssql-tools'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'srkomodo/tap'
brew 'shadowfox-updater'

tap 'twlz0ne/ccls'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']

# Other Cask applications
cask 'alacritty'
cask 'azure-data-studio'
cask 'bee'
cask 'brightness'
cask 'discord'
cask 'font-hack-nerd-font'
cask 'font-roboto'
cask 'google-drive-file-stream'
cask 'hv-ms735-config'
cask 'iterm2'
cask 'jadengeller-helium'
cask 'java8'
cask 'keybase'
cask 'lunar'
cask 'oracle-jdk'
cask 'parallels'
cask 'pgadmin4'
cask 'sensiblesidebuttons'
cask 'slack'
cask 'synergy'
cask 'ubersicht'
cask 'visual-studio-code'
cask 'xquartz'

# App Store applications
mas 'Key', id: (2.1)',
mas 'Xcode', id: id:
