# before 'export ACCEPT_EULA=y'

# Microsoft ODBC Driver for SQL Server on Linux and macOS
# https://docs.microsoft.com/en-us/sql/connect/odbc/linux-mac/installing-the-microsoft-odbc-driver-for-sql-server?view=sql-server-2017#os-x-1011-el-capitan-macos-1012-sierra-and-macos-1013-high-sierra
tap 'Microsoft/homebrew-mssql-release'
brew 'msodbcsql17'
brew 'mssql-tools'

# genetic tools; formerly from homebrew/science
brew 'samtools'
brew 'bedtools'
brew 'htslib'

# tools
brew 'docker'
brew 'docker-compose'
brew 'postgresql'
brew 'rabbitmq'

# java tools
cask 'oracle-jdk'
brew 'ant'

# C++ tools
brew 'cmake'
brew 'boost'
brew 'rabbitmq-c'

# CLI tools
brew 'ack'
brew 'awscli'
brew 'csshx'
brew 'htop'
brew 'iftop'
brew 'jq'
brew 'mtr'
brew 'nethogs'
brew 'nmap'
brew 'rename'
brew 's3cmd'
brew 'ssh-copy-id'
brew 'tree'
brew 'wget'
brew 'zlib'

# python
brew 'python'
brew 'pipenv'
