# before export ACCEPT_EULA=y

tap 'Microsoft/homebrew-mssql-release'

# Microsoft ODBC Driver for SQL Server on Linux and macOS
# https://docs.microsoft.com/en-us/sql/connect/odbc/linux-mac/installing-the-microsoft-odbc-driver-for-sql-server?view=sql-server-2017#os-x-1011-el-capitan-macos-1012-sierra-and-macos-1013-high-sierra
brew 'msodbcsql17', args: ['--no-sandbox']
brew 'mssql-tools', args: ['--env=']

# formerly homebrew/science
brew 'samtools'
brew 'bedtools'
brew 'htslib'

# java tools
cask 'java'
brew 'ant'

# other tools
brew 'ack'
brew 'awscli'
brew 'aws-sdk-cpp', args: ["with-static"]
brew 'boost'
brew 'cmake'
brew 'csshx'
brew 'htop'
brew 'iftop'
brew 'jq'
brew 'mtr'
brew 'nethogs'
brew 'nmap'
brew 'postgresql'
brew 'python3'
brew 'rabbitmq'
brew 'rabbitmq-c'
brew 'rename'
brew 's3cmd'
brew 'ssh-copy-id'
brew 'tree'
brew 'wget'
brew 'zlib'
