# =============
# brew formulae
# =============

# dev tools
# ---------
brew 'python'
brew 'node'
brew 'yarn'

# utilities
# ---------
brew 'bat'
brew 'exa'
brew 'htop'
brew 'ripgrep'
brew 'rsync'
brew 'jq'

# editors
# -------
brew 'vim'
brew 'neovim'

# ui/ux
# -----
tap 'koekeishiya/formulae'
brew 'skhd'
brew 'yabai', args: ['HEAD']

# security
# --------
brew 'gnupg'
brew 'pinentry'

# system
# ------
tap 'rcmdnk/file'

brew 'brew-file'
brew 'mas'

tap 'homebrew/services'

# misc
# ----
tap 'homebrew/core'
brew 'adns'
brew 'gdbm'
brew 'gettext'
brew 'gmp'
brew 'gnutls'
brew 'icu4c'
brew 'jemalloc'
brew 'libassuan'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libtasn1'
brew 'libtermkey'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvterm'
brew 'libyaml'
brew 'lua'
brew 'luajit'
brew 'msgpack'
brew 'ncurses'
brew 'nettle'
brew 'npth'
brew 'openssl'
brew 'p11-kit'
brew 'pcre2'
brew 'perl'
brew 'readline'
brew 'ruby'
brew 'sqlite'
brew 'unbound'
brew 'unibilium'
brew 'xz'

# ==========
# brew casks
# ==========

file ./Caskfile

