
# tap repositories and their packages

brew 'ack'
brew 'adns'
brew 'ant'
brew 'apr'
brew 'apr-util'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bedtools'
brew 'bitwarden-cli'
brew 'boost'
brew 'byobu'
brew 'cairo'
brew 'ccache'
brew 'cmake'
brew 'csshx'
brew 'entr'
brew 'erlang'
brew 'expat'
brew 'faad2'
brew 'ffmpeg'
brew 'fftw'
brew 'flac'
brew 'fltk'
brew 'fluid-synth'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'glib'
brew 'gmp'
brew 'gnutls'
brew 'gpsbabel'
brew 'graphite2'
brew 'harfbuzz'
brew 'htop'
brew 'htslib'
brew 'icu4c'
brew 'iftop'
brew 'isl'
brew 'jemalloc'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'lame'
brew 'libao'
brew 'libass'
brew 'libassuan'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libid3tag'
brew 'libidn2'
brew 'libksba'
brew 'libmpc'
brew 'libogg'
brew 'libpng'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libupnp'
brew 'libusb'
brew 'libuv'
brew 'libvorbis'
brew 'libvpx'
brew 'libvterm'
brew 'libyaml'
brew 'llvm'
brew 'lua'
brew 'luajit'
brew 'lz4'
brew 'make'
brew 'mpd'
brew 'mpfr'
brew 'msgpack'
brew 'mtr'
brew 'ncurses'
brew 'nethogs'
brew 'nettle'
brew 'newt'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'opencore-amr'
brew 'openssl'
brew 'opus'
brew 'p11-kit'
brew 'pandoc'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'popt'
brew 'portaudio'
brew 'postgresql'
brew 'python@2'
brew 'qt'
brew 'rabbitmq'
brew 'rabbitmq-c'
brew 'readline'
brew 'rename'
brew 'rtmpdump'
brew 'ruby'
brew 'rustup-init'
brew 's-lang'
brew 's3cmd'
brew 'samtools'
brew 'sdl2'
brew 'shfmt'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'taglib'
brew 'theora'
brew 'tiger-vnc'
brew 'trash'
brew 'tree'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'vim'
brew 'watchexec'
brew 'wine'
brew 'wxmac'
brew 'x264'
brew 'x265'
brew 'xvid'
brew 'xz'
brew 'zlib'



tap 'homebrew/command-not-found'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'azure-data-studio'
cask 'bee'
cask 'gimp'
cask 'insomnia'
cask 'virtualbox'
cask 'xquartz'

tap 'brewsci/bio'


tap 'koekeishiya/formulae'
brew 'cev'
brew 'chunkwm', args: ['with-logging', 'HEAD']

tap 'microsoft/mssql-release'
brew 'msodbcsql17'
brew 'mssql-tools'


tap 'rcmdnk/file'
brew 'brew-file'

tap 'srkomodo/tap'
brew 'shadowfox-updater'


# Other Cask applications
cask 'barrier'
cask 'google-drive-file-stream'
cask 'pgadmin4'
cask 'skype'
cask 'synergy'

# App Store applications
mas 'Key Codes (2.1)', id: 414568915
mas 'Xcode (10.1)', id: 497799835
